#!/usr/bin/env ruby
require 'bundler/setup'
require "pathological"
require 'yaml'
require 'database'

database = Database.new(File.join(__dir__, 'posts.yml'))

database.set "posts", {}

posts = database["posts"]

DATA.read.split("\n").each do |line|
  posts[line] = 0
end

database.save


__END__
Да бъдеш щастлив , са нужни хиляди причини ! Да бъдеш нещастен , е нужна само една !
Количеството интелект на планетата е константа, а населението расте.
За да си спечелите враг, направете услуга някому.
Нациите и хората започват да действат разумно, едва след като са изчерпали всички други възможности.
Никога не спори с тъпак, хората може да не забележат разликата.
Няма значение колко трудно и на каква цена си купил нещо, защото след като го купиш веднага ще го видиш по-евтино в друг магазин.
Винаги, когато си се приготвил да правиш нещо, трябва първо да свършиш нещо друго.
Всичко отнема повече време, отколкото си очаквал.
Невъзможно е да направиш нещата недостъпни за глупаци, защото глупаците са много изобретателни.
В природата нищо не е правилно. Следователно, ако всичко върви добре — значи нещо не е в ред.
Ако някой не го вземат, има причина - той е по-лошият вариант.
Колкото някой е по-хубав, толкова по-далече е.
Акъл Х красота Х достъпност = постоянство и вярност.
С пари любов не се купува, но можеш да се пазариш.
Най-хубавите неща в света са свободен живот и стойността на всеки лев от него.
Най-милото действие си има не чак толкова мило противодействие.
Ако изглежда твърде хубаво, за да е истина, сигурно е.
Колкото е по-красива жената, която те обича, толкова по-лесно ще я напуснеш без никакви по-сериозни чувства.
Нищо не се подобрява с възрастта.
Няма значение колко пъти си го правил, когато ти предлагат действай, защото никъде и никога не е същото.
Сексът няма калории.
Сексът отнема малко време, но причинява много беди.
Сексът се лекува с повече секс.
Сексът е 50% от това което имаш и 50% от това, което хората си мислят, че имаш.
Никакъв секс с някой от същия офис.
Сексът е като снега - никога не знаеш колко сантиметра ще бъде, нито колко дълго ще продължи.
Мъж в къща е по-добре, отколкото двама на улицата.
Ако ги хванеш за топките, сърцата и акълите им ще те последват.
Девствеността е лечима болест.
Когато жената се научи да разбира мъжа си, тя спира да го слуша.
Никога не спи с някой по-луд от теб.
Сексът е мръсен само, ако е правен правилно.
Винаги се случва в грешното време от месеца.
Най-добрият начин да държиш мъж е в твоите ръце.
Когато е тъмно, всички жени са красиви.
Посей дивите си семена събота вечер, а в неделя се моли за лоша реколта.
Колкото по-млад (млада) толкова по-добре.
Играта на любов никога не се отменя, заради тъмнината.
Не беше ябълката на дървото, а двете на земята, които причиниха бедата в градината.
Сексът се разграничава между срамежливи и грозни.
Преди да намериш твоя принц, трябва да целунеш доста жаби.
Може да има по-хубави неща от секса, може да има и по-лоши от него, но няма нищо друго като него.
Любовта е дупка в сърцето.
Любовта е предмет на химията, а сексът е предмет на физиката.
Прави го само с най-добрите.
Не можеш да имаш бебе след един месец като минеш девет жени.
Любовта е триумф на въображението над интелигентността.
По-добре да си обичал някой преди, отколкото никой никога.
Никога не лягай с жена, която има повече проблеми от теб.
Никога не се карай с изморена или отпочинала жена.
Въздържай се от вино, жени и песни, най-вече от песни.
Жената никога не забравя мъжа, който е можела да има, а мъжът - жената, която не е могъл да има.
Няма значение колко е дълга магическата пръчка, а по-важна е магията в нея.
По-добре е да си разглеждан, отколкото незабелязан.
Никога не казвай не.
Мъжът може да бъде щастлив с всяка жена, докато не я заобича.
Красотата е повърхностна, грозотата отива чак до кокала.
Любовта идва на струи.
Светът не се върти на ос.
Сексът е една от деветте причини за прераждането, другите осем нямат значение.
Усмихвай се - това кара хората да се чудят какво мислиш.
Не го прави, ако не можеш да го поддържаш.
Няма разлика между тъп и умен мъж, когато са влюбени.
Любовта е заблуда, чрез която различаваме една жена от друга.
Това няма да боли, обещавам.
Когато паркирате идеално още от първия опит.
Когато шофьорът пред вас пуска аварийките, за да ви благодари, че сте го пуснали в редицата.
Когато спите до обяд.
Когато си вземете горещ душ след дълга разходка.
Когато сутрин спонтанно се качите в колата и отидете до място, където винаги сте искали. Сам/а.
Когато се возите в количка в супермаркета.
Когато научите няколко фрази на чужд език и ги използвате в подходящ момент.
Когато помирисвате дъжда, падащ върху нагорещения асфалт през лятото.
Когато подреждате бутилките с различен алкохол, останали след празниците.
Миризмата на солено, която се носи във въздуха, когато стъпвате на плажа.
Когато ви присветват с фаровете шофьорите отсреща, за да ви съобщят, че наблизо има полиция.
Когато се стоварвате върху стария си любим диван.
Когато зачитате първите редове от книга в книжарницата и тя ви харесва.
Когато вървите в снега и слушате как той приятно хрущи под ботушите ви.
Когато сте първи пред току-що отворената каса в магазина.
Когато за малко да заспите на скучна лекция/конференция/семинар, но колегата ви побутва по рамото, за да се събудите.
Когато спортувате, докато ви заболят мускулите.
Когато на гости ви идват много близки приятели, заради които не трябва да чистите.
Когато отдалече улучите кошчето за боклук.
Когато се справите с някой от детските си страхове.
Когато си тръгвате от магазина направо с току-що купените дрехи.
Когато скочите от влак в движение.
Когато помиришете току-що изпечен хляб.
Когато уцелите зелената вълна на светофара.
Когато си отчупвате парче топъл хляб.
Когато всички колеги търсят пакетче кафе, но точно вие наметите последното, скрито в ъгъла на шкафа.
Когато се чудите какво да обядвате, а се оказва, че някой има рожден ден и черпи с вкусни неща.
Когато някой ви подава билетчето си на слизане от автобуса.
Когато непознато детенце ви закача в парка.
Когато се събуждите малко преди да звънне будилникът и осъзнаете, че има още време за сън.
Когато първи в компанията се сетите в кой филм участваше този актьор.
Когато налягането в ушите ви спада, след като самолетът кацне или автомобилът се спусне в ниското.
Когато свалите високите токчета от изморените си крака.
Когато цветето ви цъфне за първи път.
Когато намерите предмет от детството си.
Когато си извадите ръката през прозореца на колата и правите вълнички.
Когато се успокоите, след като сте се изплашили.
Когато в автобуса има много свободни места.
Когато си стоите в колата, за да чуете любимата си песен по радиото.
Когато установите, че тубата с паста за зъби е почти празна, но има количество колкото за още едно измиване.
Когато видите първите отворени обувки на краката на някого, след дългата и студена зима.
Когато влизате някъде на хладно в летните жеги.
Когато слушате любимото си парче до втръсване.
Когато си спомните колко висока ви се е струвала черешата в двора в детството ви.
Когато в ресторанта забележите, че на някого бавят ястието, а вашето идва навреме.
Когато видите как деветките се сменят с нули на километража на колата.
Когато шефът си тръгва по-рано от работа, а вие след него.
Когато най-накрая си разплетете заплетените бижута.
Когато черупката на яйцето се бели лесно.
Когато си намирате забравени пари в джоба на панталона.
Когато кихнете 3 или повече пъти един след друг.
Моментът, в който публиката разбира коя е следващата песен, която започва да свири групата.
Когато стъпвате боси в студената река.
Когато стъпвате боси в снежна пряспа.
Когато разберете, че от книгата, която много ви харесва, остават още много страници.
Когато в петък вечерта си мислите, че е четвъртък и изведнъж разберете истината.
Когато счупите ледената коричка на локва с крак.
Когато заспивате на излитане и да се събуждате, когато самолетът каца.
Когато спите под открито небе.
Когато се подхлъзнете, но не паднете.
Когато с някой друг кажете едно и също нещо по едно и също време.
Когато си тръгваш късно от купон с някой готин човек.
Когато получите дълго чакан смс/имейл.
Когато се събудите след кошмар и осъзнаете, че е било само сън.
Когато най-накрая измиете всички чаши и чинии, след като са си тръгнали гостите.
Когато някой, с когото имате среща, идва навреме.
Когато се напрягате, за да вдигнете нещо видимо тежко, а то да се окаже леко.
Когато четете под одеялото с фенерче.
Когато пицата, поръчана посред нощ, дойде много бързо.
Когато стъпалата ви потънат в пясъка на плажа.
Когато отлепите защитното фолио от дисплея на новия си телефон.
Когато най-накрая убиете досадната хлебарка/комар/муха.
Когато по време на отпуска забравяте кой ден от седмицата е, а и не те интересува.
Когато отстраните проблема на телевизора/пералнята.
Когато непознати хора ви честитят рождения ден.
Когато откривате скрити възможности на предметите, които уж отдавна познавате.
Когато никой от компанията не разбира как работи нещо, а вие го вземате и го включвате.
Когато гледате през прозореца как самолетът се отлепва от земята.
Когато се спуснете с велосипеда/ските/ борда надолу по хълма, по който трудно сте се изкатерили.
Когато извадите от дланта си забилата се треска.
Когато се окажете на опашката, която минава по-бързо.
Когато героят от филма казва любимата ви реплика, която си научил наизуст.
Когато видите бързо тичаща катеричка в парка.
Когато си купите нещо на промоция.
Когато чупите с лъжичка коричката на крем брюле.
Когато оризът, който готвите, набъбва, но не слепва.
Когато опитът ви да поправите нещо се окаже успешен.
Когато човекът на опашката ви пусне пред него.
Когато си спомните как е започнало всичко – разговор, запознанство.
Когато слушате дъжда, който пада върху палатката.
Когато ви се отпуши носът след дълга хрема.
Когато лесно се вмъкнете в дънките си от по-миналото лято.
Първата цигара след дълго време без пушене.
Когато лягате в хладното легло и чаршафите постепенно се затоплят.
Когато случайно срещнете познат на улицата.
Когато неочаквано си спомните забравена парола за електронна поща.
Когато издърпате бурена заедно с корените му.
Когато командировката ви съвпада с профилактиката на топлата вода.
Първият ден от лятната отпуска.
Когато нещо приятно завърши още по-приятно.
